In [ ]:
##################################################################################
#         U B E R   Y   O T R O S   S E R V I C I O S                            #
##################################################################################

In [4]:
# Carga de librerias
import pandas as pd

In [5]:
# 2. Carga de datos de compañias.
df_companias = pd.read_csv('../data/Companies.csv')
df_companias.head()

   id_company name_company
0           1         Uber
1           2      Skyline
2           3     Prestige
3           4         Lyft
4           5    Highclass

In [6]:
df_companias.isna().sum()

id_company      0
name_company    0
dtype: int64

In [7]:
df_companias.dtypes

id_company       int64
name_company    object
dtype: object

In [8]:
# Carga de datos de bases de taxis.
df_bases_taxi = pd.read_csv('../data/NYCBases.csv')
df_bases_taxi.head()

  id_base                 name_base  id_company  number_vehicles
0  B00008      T-D MAINTENANCE CORP          12              122
1  B00009           T-D MAINTENANCE          12              121
2  B00013         LOVE CORP CAR INC          12              181
3  B00014       NY ONE CORP CAR INC          12              181
4  B00021  MEXICANA HIGH CLASS INC.          12               31

In [9]:
df_bases_taxi.dtypes

id_base            object
name_base          object
id_company          int64
number_vehicles     int64
dtype: object

In [10]:
df_bases_taxi.isna().sum()

id_base             0
name_base          13
id_company          0
number_vehicles     0
dtype: int64

In [29]:
df_bases_taxi['name_base'] = df_bases_taxi['name_base'].fillna('Unknown')

In [12]:
df_bases_taxi.isna().sum()

id_base            0
name_base          0
id_company         0
number_vehicles    0
dtype: int64

In [ ]:
#Uniendo datos de compañias y bases

In [15]:
df_bases_taxi_full = pd.merge(df_bases_taxi, df_companias['name_company'], left_on='id_company', right_index=True).sort_index()

In [17]:
df_bases_taxi_full.head()

,id_base,name_base,id_company,number_vehicles,name_company
14,B00111,Desconocido,2,55,Prestige
28,B00256,Desconocido,10,92,American
63,B00887,DIAL 7 CAR & LIMOUSINE SERVICE INC.,9,59,Carmel
92,B01196,Desconocido,8,76,Dial7
113,B01338,Desconocido,3,67,Lyft

In [19]:
df_bases_taxi_full.dtypes

id_base            object
name_base          object
id_company          int64
number_vehicles     int64
name_company       object
dtype: object

In [27]:
df_bases_taxi_full.groupby(['name_company','id_base'])['number_vehicles'].value_counts()

name_company     id_base  number_vehicles
American         B00256   92                 1
Carmel           B00887   59                 1
Dial7            B01196   76                 1
Diplo            B02216   45                 1
Federal          B01536   35                 1
Firstclass       B01717   71                 1
Highclass        B02510   45                 1
Lyft             B01338   67                 1
Other companies  B01362   61                 1
Prestige         B00111   55                 1
Skyline          B02512   57                 1
                 B02598   24                 1
                 B02617   36                 1
                 B02682   32                 1
                 B02764   29                 1
Name: number_vehicles, dtype: int64

In [28]:
df_bases_taxi_full

,id_base,name_base,id_company,number_vehicles,name_company
14,B00111,Desconocido,2,55,Prestige
28,B00256,Desconocido,10,92,American
63,B00887,DIAL 7 CAR & LIMOUSINE SERVICE INC.,9,59,Carmel
92,B01196,Desconocido,8,76,Dial7
113,B01338,Desconocido,3,67,Lyft
119,B01362,AMERICAN BASE NO.1 INC,11,61,Other companies
138,B01536,Desconocido,6,35,Federal
159,B01717,Desconocido,5,71,Firstclass
228,B02216,Desconocido,7,45,Diplo
265,B02510,Desconocido,4,45,Highclass
267,B02512,Desconocido,1,57,Skyline
285,B02598,Desconocido,1,24,Skyline
289,B02617,Desconocido,1,36,Skyline
308,B02682,Desconocido,1,32,Skyline
330,B02764,Desconocido,1,29,Skyline